# Data Cleaning

Data cleaning, also known as data cleansing or data scrubbing, is the process of identifying and correcting (or removing) errors, inconsistencies, and inaccuracies in datasets. It ensures that the data is accurate, complete, and reliable for analysis and decision-making.

In [15]:
import pandas as pd

# Load an Excel file
df = pd.read_excel("raw_large_dataset.xlsx", sheet_name="Sheet1")

# Display first few rows
print(df.head())

     ID     Name   Age    Salary  Join_Date        Country  Experience_Years  \
0  1002    David  35.0  1.000000 2020-12-05  United States                 5
1  1003      Eve  25.0  0.333333 2020-12-05         Mexico                 3
2  1005  Charlie  30.0  0.333333 2021-01-10  United States                 5
3  1006      Eve  40.0  0.511167 2021-01-10         Canada                 5
4  1007      Eve  30.0  0.511167 2021-03-15         Canada                 3

   Department_Finance  Department_HR  Department_IT  Department_nan
0                   0              0            0.0               1
1                   0              1            0.0               0
2                   0              0            0.0               1
3                   0              0            1.0               0
4                   0              0            1.0               0

In [16]:
# Check missing values
missing_values = df.isnull().sum()
missing_values

ID                     0
Name                   0
Age                   11
Salary                 9
Join_Date              0
Country                0
Experience_Years       0
Department_Finance     0
Department_HR          0
Department_IT          7
Department_nan         0
dtype: int64

In [17]:
# Step 1: Handling Missing Data
df['Age'].fillna(df['Age'].median(), inplace=True)
df['Salary'].fillna(df['Salary'].mean(), inplace=True)
df['Department_IT'].fillna('Unknown', inplace=True)

C:\Users\Fanuel\AppData\Local\Temp\ipykernel_15848\2560028756.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(df['Age'].median(), inplace=True)
C:\Users\Fanuel\AppData\Local\Temp\ipykernel_15848\2560028756.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Salary'].fillna(df['Salary'].mean(), inplace=True)
C:\Users\Fanuel\AppData\Local\Temp\ipykernel_15848\2560028756.py:4: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Department_IT'].fillna('Unknown', inplace=True)
C:\Users\Fanuel\AppData\Local\Temp\ipykernel_15848\2560028756.py:4: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'Unknown' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  df['Department_IT'].fillna('Unknown', inplace=True)

In [18]:
# Step 2: Removing Duplicates
df.drop_duplicates(subset=['ID'], keep='first', inplace=True)

In [8]:
# Step 3: Standardizing Data Formats
df['Name'] = df['Name'].str.strip()
df['Country'] = df['Country'].str.lower().replace({'usa': 'united states', 'canada': 'canada', 'mexico': 'mexico'})
df['Join_Date'] = pd.to_datetime(df['Join_Date'], errors='coerce')

In [9]:
# Step 4: Correcting Inconsistent Data
df['Country'] = df['Country'].str.title()

In [ ]:
# Step 5: Handling Outliers
df.loc[df['Experience_Years'] < 0, 'Experience_Years'] = df['Experience_Years'].median()

In [20]:
# Step 6: Normalizing & Scaling Data (Min-Max Scaling for Salary)
df['Salary'] = (df['Salary'] - df['Salary'].min()) / (df['Salary'].max() - df['Salary'].min())

df.head()

,ID,Name,Age,Salary,Join_Date,Country,Experience_Years,Department_Finance,Department_HR,Department_IT,Department_nan
0,1002,David,35.0,1.000000,2020-12-05,United States,5,0,0,0.0,1
1,1003,Eve,25.0,0.333333,2020-12-05,Mexico,3,0,1,0.0,0
2,1005,Charlie,30.0,0.333333,2021-01-10,United States,5,0,0,0.0,1
3,1006,Eve,40.0,0.511167,2021-01-10,Canada,5,0,0,1.0,0
4,1007,Eve,30.0,0.511167,2021-03-15,Canada,3,0,0,1.0,0

In [11]:
# Step 7: Encoding Categorical Data (One-Hot Encoding for Department)
df = pd.get_dummies(df, columns=['Department_IT'])

In [ ]:
# Step 10: Data Validation & Quality Checks
df.dropna(subset=['Join_Date'], inplace=True)  # Removing rows with invalid dates

In [ ]:
# Display cleaned dataset
print(df.head())
print(df.shape)

# Exercises

In [95]:
# Data Cleaning Exercises

import pandas as pd
import numpy as np

# Creating a sample dataset with data quality issues for exercises
data = {
    'ID': [101, 102, 103, 104, 105, 106, 107, 107],  # Duplicate ID
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Frank', 'Grace', 'Grace '],  # Extra space in last entry
    'Age': [25, np.nan, 30, 45, 29, 35, 27, 27],  # Missing age value
    'Salary': [50000, 60000, np.nan, 80000, 45000, 70000, 55000, 55000],  # Missing salary value
    'Join_Date': ['2021-01-10', '2020-12-05', '2021-03-15', '2020-11-25', '2021-07-19', '2021-02-22', 'Invalid Date', '2021-08-30'],  # Invalid date format
    'Country': ['USA', 'usa', 'United States', 'Canada', 'canada', 'Mexico', 'MEXICO', 'UK'],  # Inconsistent country names
    'Department': ['HR', 'IT', 'HR', 'Finance', 'IT', np.nan, 'Finance', 'HR'],  # Missing department
    'Experience_Years': [3, -1, 5, 10, 4, 7, 3, 3],  # Negative value error
}
dc= pd.DataFrame(data)
duplicate_count = dc.duplicated('ID').sum()  
duplicate_count

1

## Exercise 1

Identify and remove duplicate rows based on the 'ID' column

In [75]:
dc.drop_duplicates(subset=["ID"], keep="first", inplace=True)
print(dc.head(10))

    ID     Name   Age    Salary  Join_Date        Country  Experience_Years  \
0  101    Alice  25.0  0.142857 2021-01-10            Usa                 3
2  103  Charlie  30.0  0.408163 2021-03-15  United States                 5
3  104    David  45.0  1.000000 2020-11-25         Canada                10
4  105      Eve  29.0  0.000000 2021-07-19         Canada                 4
5  106    Frank  35.0  0.714286 2021-02-22         Mexico                 7
6  107    Grace  27.0  0.285714        NaT         Mexico                 3

   Department_Finance  Department_HR  Department_IT  Department_Unknown
0               False           True          False               False
2               False           True          False               False
3                True          False          False               False
4               False          False           True               False
5               False          False          False                True
6                True          False          False               False

## Exercise 2

Handle missing values in 'Age', 'Salary', and 'Department'.

In [19]:
missing_values = dc.isnull().sum()
missing_values

ID                  0
Name                0
Age                 1
Salary              1
Join_Date           0
Country             0
Department          1
Experience_Years    0
dtype: int64

In [79]:
dc['Age'].fillna(dc['Age'].median(), inplace=True)
dc['Salary'].fillna(dc['Salary'].mean(), inplace=True)
dc['Department'].fillna('Unknown', inplace=True)
print(dc.head(10))

C:\Users\K00010213\AppData\Local\Temp\ipykernel_28712\1618205415.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  dc['Age'].fillna(dc['Age'].median(), inplace=True)
C:\Users\K00010213\AppData\Local\Temp\ipykernel_28712\1618205415.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  dc['Salary'].fillna(dc['Salary'].mean(), inplace=True)

KeyError: 'Department'

## Exercise 3

Standardize 'Country' names to maintain consistency

In [81]:
dc['Country'] = dc['Country'].str.title()
print(dc.head(20))

    ID     Name   Age    Salary  Join_Date        Country  Experience_Years  \
0  101    Alice  25.0  0.142857 2021-01-10            Usa                 3
2  103  Charlie  30.0  0.408163 2021-03-15  United States                 5
3  104    David  45.0  1.000000 2020-11-25         Canada                10
4  105      Eve  29.0  0.000000 2021-07-19         Canada                 4
5  106    Frank  35.0  0.714286 2021-02-22         Mexico                 7
6  107    Grace  27.0  0.285714        NaT         Mexico                 3

   Department_Finance  Department_HR  Department_IT  Department_Unknown
0               False           True          False               False
2               False           True          False               False
3                True          False          False               False
4               False          False           True               False
5               False          False          False                True
6                True          False          False               False

## Exercise 4

Convert 'Join_Date' to datetime format, handling invalid entries

In [83]:

dc["Join_Date"] = pd.to_datetime(dc["Join_Date"],errors='coerce')
print(dc.head(10))

    ID     Name   Age    Salary  Join_Date        Country  Experience_Years  \
0  101    Alice  25.0  0.142857 2021-01-10            Usa                 3
2  103  Charlie  30.0  0.408163 2021-03-15  United States                 5
3  104    David  45.0  1.000000 2020-11-25         Canada                10
4  105      Eve  29.0  0.000000 2021-07-19         Canada                 4
5  106    Frank  35.0  0.714286 2021-02-22         Mexico                 7
6  107    Grace  27.0  0.285714        NaT         Mexico                 3

   Department_Finance  Department_HR  Department_IT  Department_Unknown
0               False           True          False               False
2               False           True          False               False
3                True          False          False               False
4               False          False           True               False
5               False          False          False                True
6                True          False          False               False

## Exercise 5

Remove extra spaces in the 'Name' column.

In [85]:
dc['Name'] = dc['Name'].str.strip()
print(dc.head(10))

    ID     Name   Age    Salary  Join_Date        Country  Experience_Years  \
0  101    Alice  25.0  0.142857 2021-01-10            Usa                 3
2  103  Charlie  30.0  0.408163 2021-03-15  United States                 5
3  104    David  45.0  1.000000 2020-11-25         Canada                10
4  105      Eve  29.0  0.000000 2021-07-19         Canada                 4
5  106    Frank  35.0  0.714286 2021-02-22         Mexico                 7
6  107    Grace  27.0  0.285714        NaT         Mexico                 3

   Department_Finance  Department_HR  Department_IT  Department_Unknown
0               False           True          False               False
2               False           True          False               False
3                True          False          False               False
4               False          False           True               False
5               False          False          False                True
6                True          False          False               False

## Exercise 6

Fix negative values in 'Experience_Years'

In [89]:
dc['Experience_Years'] = dc['Experience_Years'].abs()
print(dc.head(20))

    ID     Name   Age    Salary  Join_Date        Country  Experience_Years  \
0  101    Alice  25.0  0.142857 2021-01-10            Usa                 3
2  103  Charlie  30.0  0.408163 2021-03-15  United States                 5
3  104    David  45.0  1.000000 2020-11-25         Canada                10
4  105      Eve  29.0  0.000000 2021-07-19         Canada                 4
5  106    Frank  35.0  0.714286 2021-02-22         Mexico                 7
6  107    Grace  27.0  0.285714        NaT         Mexico                 3

   Department_Finance  Department_HR  Department_IT  Department_Unknown
0               False           True          False               False
2               False           True          False               False
3                True          False          False               False
4               False          False           True               False
5               False          False          False                True
6                True          False          False               False

In [63]:
dc = dc[dc['Experience_Years'] >= 0]

## Exercise 7

Normalize 'Salary' using Min-Max scaling

In [91]:
dc['Salary'] = (dc['Salary'] - dc['Salary'].min()) / (dc['Salary'].max() - dc['Salary'].min())

dc.head()

,ID,Name,Age,Salary,Join_Date,Country,Experience_Years,Department_Finance,Department_HR,Department_IT,Department_Unknown
0,101,Alice,25.0,0.142857,2021-01-10,Usa,3,False,True,False,False
2,103,Charlie,30.0,0.408163,2021-03-15,United States,5,False,True,False,False
3,104,David,45.0,1.000000,2020-11-25,Canada,10,True,False,False,False
4,105,Eve,29.0,0.000000,2021-07-19,Canada,4,False,False,True,False
5,106,Frank,35.0,0.714286,2021-02-22,Mexico,7,False,False,False,True

## Exercise 8

One-hot encode the 'Department' column

In [97]:
dc = pd.get_dummies(dc, columns=['Department'])
print(dc.head(11))

    ID     Name   Age   Salary     Join_Date        Country  Experience_Years  \
0  101    Alice  25.0  50000.0    2021-01-10            USA                 3
1  102      Bob   NaN  60000.0    2020-12-05            usa                -1
2  103  Charlie  30.0      NaN    2021-03-15  United States                 5
3  104    David  45.0  80000.0    2020-11-25         Canada                10
4  105      Eve  29.0  45000.0    2021-07-19         canada                 4
5  106    Frank  35.0  70000.0    2021-02-22         Mexico                 7
6  107    Grace  27.0  55000.0  Invalid Date         MEXICO                 3
7  107   Grace   27.0  55000.0    2021-08-30             UK                 3

   Department_Finance  Department_HR  Department_IT
0               False           True          False
1               False          False           True
2               False           True          False
3                True          False          False
4               False          False           True
5               False          False          False
6                True          False          False
7               False           True          False

## Exercise 9

 Write a function that combines all the above processes

In [99]:
print(dc.head())
print(dc.shape)

    ID     Name   Age   Salary   Join_Date        Country  Experience_Years  \
0  101    Alice  25.0  50000.0  2021-01-10            USA                 3
1  102      Bob   NaN  60000.0  2020-12-05            usa                -1
2  103  Charlie  30.0      NaN  2021-03-15  United States                 5
3  104    David  45.0  80000.0  2020-11-25         Canada                10
4  105      Eve  29.0  45000.0  2021-07-19         canada                 4

   Department_Finance  Department_HR  Department_IT
0               False           True          False
1               False          False           True
2               False           True          False
3                True          False          False
4               False          False           True
(8, 10)

In [15]:
import pandas as pd
import numpy as np

# Creating a sample dataset with data quality issues for exercises
data = {
    'ID': [101, 102, 103, 104, 105, 106, 107, 107],  # Duplicate ID
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Frank', 'Grace', 'Grace '],  # Extra space in last entry
    'Age': [25, np.nan, 30, 45, 29, 35, 27, 27],  # Missing age value
    'Salary': [50000, 60000, np.nan, 80000, 45000, 70000, 55000, 55000],  # Missing salary value
    'Join_Date': ['2021-01-10', '2020-12-05', '2021-03-15', '2020-11-25', '2021-07-19', '2021-02-22', 'Invalid Date', '2021-08-30'],  # Invalid date format
    'Country': ['USA', 'usa', 'United States', 'Canada', 'canada', 'Mexico', 'MEXICO', 'UK'],  # Inconsistent country names
    'Department': ['HR', 'IT', 'HR', 'Finance', 'IT', np.nan, 'Finance', 'HR'],  # Missing department
    'Experience_Years': [3, -1, 5, 10, 4, 7, 3, 3],  # Negative value error
}
df = pd.DataFrame(data)
df_cleaned = clean_and_transform_data(df)